sergz72/RISCV/CH32V307/lib/USBLIB/audio/ch32v30x_usbfs_device_old.c
    if( intflag & USBFS_UIF_TRANSFER )
    {
        switch ( intst & USBFS_UIS_TOKEN_MASK )
        {
            /* data-in stage processing */
            case USBFS_UIS_TOKEN_IN:
                switch ( intst & ( USBFS_UIS_TOKEN_MASK | USBFS_UIS_ENDP_MASK ) )
                {
                    /* end-point 0 data in interrupt */
                    case USBFS_UIS_TOKEN_IN | DEF_UEP0:
                        if( USBFS_SetupReqLen == 0 )
                        {
                           USBFSD->UEP0_RX_CTRL = USBFS_UEP_R_TOG | USBFS_UEP_R_RES_ACK;
                        }
                        if ( ( USBFS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                        {
                            /* Non-standard request endpoint 0 Data upload */
                        }
                        else
                        {
                            switch( USBFS_SetupReqCode )
                            {
                                case USB_GET_DESCRIPTOR:
                                        len = USBFS_SetupReqLen >= DEF_USBD_UEP0_SIZE ? DEF_USBD_UEP0_SIZE : USBFS_SetupReqLen;
                                        memcpy( USBFS_EP0_Buf, pUSBFS_Descr, len );
                                        USBFS_SetupReqLen -= len;
                                        pUSBFS_Descr += len;
                                        USBFSD->UEP0_TX_LEN   = len;
                                        USBFSD->UEP0_TX_CTRL ^= USBFS_UEP_T_TOG;
                                        break;

                                case USB_SET_ADDRESS:
                                        USBFSD->DEV_ADDR = (USBFSD->DEV_ADDR & USBFS_UDA_GP_BIT) | USBFS_DevAddr;
                                        break;

                                default:
                                        break;
                            }
                        }
                        break;

                    default :
                        break;
                }
                break;

            /* data-out stage processing */
            case USBFS_UIS_TOKEN_OUT:
                switch ( intst & ( USBFS_UIS_TOKEN_MASK | USBFS_UIS_ENDP_MASK ) )
                {
                    /* end-point 0 data out interrupt */
                    case USBFS_UIS_TOKEN_OUT | DEF_UEP0:
                        len = USBFSD->RX_LEN;
                        if ( intst & USBFS_UIS_TOG_OK )
                        {
                            USBFS_SetupReqLen = 0;
                            if( ( USBFS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                            {
                                if( ( USBFS_SetupReqType & USB_REQ_TYP_MASK ) == USB_REQ_TYP_CLASS )
                                {
                                    if ((USBFS_SetupReqType & USB_UAC_REQ_TYPE_MASK) == USB_UAC_REQ_TYPE_ID_INF)
                                    {
                                        switch( USBFS_SetupReqCode )
                                        {
                                            case UAC_SET_CUR:
                                                /* Entity ID: 2 */
                                                if (USBFS_SetupReqIndex == 0x0200)
                                                {
                                                    switch ((USBFS_SetupReqValue >> 8) & 0xFF) 
                                                    {
                                                        case UAC_CS_MUTE_CONTROL:
                                                            uac_headphone_unit.feature_unit.mute = USBFS_EP0_Buf[ 0 ];
                                                            break;
                                                        case UAC_CS_VOLUME_CONTROL:
                                                            if ((USBFS_SetupReqValue & 0xFF) == 0x01 ) 
                                                            {
                                                                uac_headphone_unit.feature_unit.volume_l = USBFS_EP0_Buf[0] | (USBFS_EP0_Buf[1] << 8);
                                                            }
                                                            else if ((USBFS_SetupReqValue & 0xFF) == 0x02 ) 
                                                            {
                                                                uac_headphone_unit.feature_unit.volume_r = USBFS_EP0_Buf[0] | (USBFS_EP0_Buf[1] << 8);
                                                            }
                                                            else
                                                            {
                                                                errflag = 0xFF;
                                                            }
                                                            break;
                                                        default:
                                                            errflag = 0xFF;
                                                            break;
                                                    }
                                                }
                                                else
                                                {
                                                    errflag = 0xFF;
                                                }
                                                break;
                                            case UAC_SET_MIN:
                                            case UAC_SET_MAX:
                                            case UAC_SET_RES:
                                            case UAC_SET_MEM:
                                                errflag = 0xFF;
                                                break;
                                            default:
                                                break;
                                        }
                                    }
                                    else if((USBFS_SetupReqType & USB_UAC_REQ_TYPE_MASK) == USB_UAC_REQ_TYPE_ENDP)
                                    {
                                        switch( USBFS_SetupReqCode )
                                        {
                                            case UAC_CS_SAMPLING_FREQ_CONTROL:
                                                /* add your code here */
                                                break;
                                            case UAC_CS_PITCH_CONTROL:
                                                /* add your code here */
                                                break;
                                            default:
                                                errflag = 0xFF;
                                                break;
                                        }
                                    }
                                    else
                                    {
                                        errflag = 0xFF;
                                    }
                                }
                            }
                            else
                            {
                                /* Standard request end-point 0 Data download */
                                /* Add your code here */
                            }
                        }

