sergz72/RISCV/CH32V307/lib/USBLIB/audio/ch32v30x_usbfs_device_old.c
                        if( USBFS_SetupReqLen == 0 )
                        {
                            USBFSD->UEP0_TX_LEN  = 0;
                            USBFSD->UEP0_TX_CTRL = USBFS_UEP_T_TOG | USBFS_UEP_T_RES_ACK;
                        }
                        break;
                    /* end-point 3 data out interrupt */
                    case USBFS_UIS_TOKEN_OUT | DEF_UEP3:
                        if ( intst & USBFS_UIS_TOG_OK )
                        {
                            //todo
                        }
                        break;
                }
                break;

            /* Setup stage processing */
            case USBFS_UIS_TOKEN_SETUP:
                USBFSD->UEP0_TX_CTRL = USBFS_UEP_T_TOG|USBFS_UEP_T_RES_NAK;
                USBFSD->UEP0_RX_CTRL = USBFS_UEP_R_TOG|USBFS_UEP_R_RES_NAK;
                /* Store All Setup Values */
                USBFS_SetupReqType  = pUSBFS_SetupReqPak->bRequestType;
                USBFS_SetupReqCode  = pUSBFS_SetupReqPak->bRequest;
                USBFS_SetupReqLen   = pUSBFS_SetupReqPak->wLength;
                USBFS_SetupReqValue = pUSBFS_SetupReqPak->wValue;
                USBFS_SetupReqIndex = pUSBFS_SetupReqPak->wIndex;
                len = 0;
                errflag = 0;
                if ( ( USBFS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                {
                    if( ( USBFS_SetupReqType & USB_REQ_TYP_MASK ) == USB_REQ_TYP_CLASS )
                    {
                        if ((USBFS_SetupReqType & USB_UAC_REQ_TYPE_MASK) == USB_UAC_REQ_TYPE_ID_INF)
                        {
                            switch( USBFS_SetupReqCode )
                            {
                                case UAC_GET_CUR:
                                    /* Entity ID: 2 */
                                    if (USBFS_SetupReqIndex == 0x0200)
                                    {
                                        switch ((USBFS_SetupReqValue >> 8) & 0xFF) 
                                        {
                                            case UAC_CS_MUTE_CONTROL:
                                                USBFS_EP0_Buf[ 0 ] = uac_headphone_unit.feature_unit.mute;    
                                                break;
                                            case UAC_CS_VOLUME_CONTROL:
                                                if ((USBFS_SetupReqValue & 0xFF) == 0x01 ) 
                                                {
                                                    *(uint16_t *)USBFS_EP0_Buf = uac_headphone_unit.feature_unit.volume_l;
                                                }
                                                else if ((USBFS_SetupReqValue & 0xFF) == 0x02 ) 
                                                {
                                                    *(uint16_t *)USBFS_EP0_Buf = uac_headphone_unit.feature_unit.volume_r;
                                                }
                                                else
                                                {
                                                    errflag = 0xFF;
                                                }
                                                break;
                                            default:
                                                errflag = 0xFF;
                                                break;
                                        }
                                    }
                                    else
                                    {
                                        errflag = 0xFF;
                                    }
                                    break;
                                case UAC_GET_MIN:
                                    /* Entity ID: 2 */
                                    if (USBFS_SetupReqIndex == 0x0200)
                                    {
                                        switch ((USBFS_SetupReqValue >> 8) & 0xFF) 
                                        {
                                            case UAC_CS_VOLUME_CONTROL:
                                                if ((USBFS_SetupReqValue & 0xFF) == 0x01 ) 
                                                {
                                                    *(uint16_t *)USBFS_EP0_Buf = UAC_FEATURE_VOLUME_MIN;
                                                }
                                                else if ((USBFS_SetupReqValue & 0xFF) == 0x02 ) 
                                                {
                                                    *(uint16_t *)USBFS_EP0_Buf = UAC_FEATURE_VOLUME_MIN;
                                                }
                                                else
                                                {
                                                    errflag = 0xFF;
                                                }
                                                break;
                                            default:
                                                errflag = 0xFF;
                                                break;
                                        }
                                    }
                                    else
                                    {
                                        errflag = 0xFF;
                                    }
                                    break;
                                case UAC_GET_MAX:
                                    /* Entity ID: 2 */
                                    if (USBFS_SetupReqIndex == 0x0200)
                                    {
                                        switch ((USBFS_SetupReqValue >> 8) & 0xFF) 
                                        {
                                            case UAC_CS_VOLUME_CONTROL:
                                                if ((USBFS_SetupReqValue & 0xFF) == 0x01 ) 
                                                {
                                                    *(uint16_t *)USBFS_EP0_Buf = UAC_FEATURE_VOLUME_MAX;
                                                }
                                                else if ((USBFS_SetupReqValue & 0xFF) == 0x02 ) 
                                                {
                                                    *(uint16_t *)USBFS_EP0_Buf = UAC_FEATURE_VOLUME_MAX;
                                                }
                                                else
                                                {
                                                    errflag = 0xFF;
                                                }
                                                break;
                                            default:
                                                errflag = 0xFF;
                                                break;
                                        }
                                    }
                                    else
                                    {
                                        errflag = 0xFF;
                                    }
                                    break;

