sergz72/RISCV/CH32V307/lib/USBLIB/audio/ch32v30x_usbfs_device_old.c
                                case UAC_GET_RES:
                                    /* Entity ID: 2 */
                                    if (USBFS_SetupReqIndex == 0x0200)
                                    {
                                        switch ((USBFS_SetupReqValue >> 8) & 0xFF) 
                                        {
                                            case UAC_CS_VOLUME_CONTROL:
                                                if ((USBFS_SetupReqValue & 0xFF) == 0x01 ) 
                                                {
                                                    *(uint16_t *)USBFS_EP0_Buf = UAC_FEATURE_VOLUME_RES;
                                                }
                                                else if ((USBFS_SetupReqValue & 0xFF) == 0x02 ) 
                                                {
                                                    *(uint16_t *)USBFS_EP0_Buf = UAC_FEATURE_VOLUME_RES;
                                                }
                                                else
                                                {
                                                    errflag = 0xFF;
                                                }
                                                break;
                                            default:
                                                errflag = 0xFF;
                                                break;
                                        }
                                    }
                                    else
                                    {
                                        errflag = 0xFF;
                                    }
                                    break;
                                case UAC_SET_CUR:
                                    break;
                                default:
                                    errflag = 0xFF;
                                    break;
                            }
                        }
                        else if ((USBFS_SetupReqType & USB_UAC_REQ_TYPE_MASK) == USB_UAC_REQ_TYPE_ENDP)
                        {
                            switch( USBFS_SetupReqCode )
                            {
                                case UAC_CS_SAMPLING_FREQ_CONTROL:
                                case UAC_CS_PITCH_CONTROL:
                                    break;
                                default:
                                    errflag = 0xFF;
                                    break;
                            }
                        }
                        else
                        {
                            errflag = 0xFF;
                        }


                    }
                }
                else
                {
                    /* usb standard request processing */
                    switch( USBFS_SetupReqCode )
                    {
                        /* get device/configuration/string/report/... descriptors */
                        case USB_GET_DESCRIPTOR:
                            switch( (uint8_t)( USBFS_SetupReqValue >> 8 ) )
                            {
                                /* get usb device descriptor */
                                case USB_DESCR_TYP_DEVICE:
                                    pUSBFS_Descr = MyDevDescr;
                                    len = DEF_USBD_DEVICE_DESC_LEN;
                                    break;

                                /* get usb configuration descriptor */
                                case USB_DESCR_TYP_CONFIG:
                                    pUSBFS_Descr = MyCfgDescr;
                                    len = DEF_USBD_CONFIG_DESC_LEN;
                                    break;

                                /* get usb string descriptor */
                                case USB_DESCR_TYP_STRING:
                                    switch( (uint8_t)( USBFS_SetupReqValue & 0xFF ) )
                                    {
                                        /* Descriptor 0, Language descriptor */
                                        case DEF_STRING_DESC_LANG:
                                            pUSBFS_Descr = MyLangDescr;
                                            len = DEF_USBD_LANG_DESC_LEN;
                                            break;

                                        /* Descriptor 1, Manufacturers String descriptor */
                                        case DEF_STRING_DESC_MANU:
                                            pUSBFS_Descr = MyManuInfo;
                                            len = DEF_USBD_MANU_DESC_LEN;
                                            break;

                                        /* Descriptor 2, Product String descriptor */
                                        case DEF_STRING_DESC_PROD:
                                            pUSBFS_Descr = MyProdInfo;
                                            len = DEF_USBD_PROD_DESC_LEN;
                                            break;

                                        /* Descriptor 3, Serial-number String descriptor */
                                        case DEF_STRING_DESC_SERN:
                                            pUSBFS_Descr = MySerNumInfo;
                                            len = DEF_USBD_SN_DESC_LEN;
                                            break;

                                        default:
                                            errflag = 0xFF;
                                            break;
                                    }
                                    break;

                                default :
                                    errflag = 0xFF;
                                    break;
                            }

                            /* Copy Descriptors to Endp0 DMA buffer */
                            if( USBFS_SetupReqLen>len )
                            {
                                USBFS_SetupReqLen = len;
                            }
                            len = (USBFS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBFS_SetupReqLen;
                            memcpy( USBFS_EP0_Buf, pUSBFS_Descr, len );
                            pUSBFS_Descr += len;
                            break;

                        /* Set usb address */
                        case USB_SET_ADDRESS:
                            USBFS_DevAddr = (uint8_t)( USBFS_SetupReqValue & 0xFF );
                            break;

                        /* Get usb configuration now set */
                        case USB_GET_CONFIGURATION:
                            USBFS_EP0_Buf[0] = USBFS_DevConfig;
                            if ( USBFS_SetupReqLen > 1 )
                            {
                                USBFS_SetupReqLen = 1;
                            }
                            break;

                        /* Set usb configuration to use */
                        case USB_SET_CONFIGURATION:
                            USBFS_DevConfig = (uint8_t)( USBFS_SetupReqValue & 0xFF );
                            USBFS_DevEnumStatus = 0x01;
                            break;

